app/controllers/emails_controller.rb

  def index
    @emails = Email.all
---
SELECT "emails".* FROM "emails"

  def show

    @email = Email.find(params[:id])
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def create
    @email = Email.new(
      object: Faker::Book.title,
      body: Faker::Movies::BackToTheFuture.quote)


      if @email.save
---
INSERT INTO "emails" ("object", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["object", "[\"irony\", \"keffiyeh\", \"humblebrag\"]"], ["body", "Marty, will we ever see you again?"], ["created_at", "2020-05-28 12:18:28.457056"], ["updated_at", "2020-05-28 12:18:28.457056"]]

  def destroy
    @email = Email.find(params[:id])
    @email.destroy
---
SELECT  "emails".* FROM "emails" WHERE "emails"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
DELETE FROM "emails" WHERE "emails"."id" = $1  [["id", 59]]